 [
  {
  "name":"Go Food Shopping",
  "activityCode":"FS1",
  "description":"You need a shopping list and money!",
  "category":"Do we need this?",
  "icon":"shopping-cart",
  "instructions":
  [
   {
   "title":"Enter the Store",
   "instructionCode":"FS1-S1",
   "details":"When you enter the store, you will see a number of rows/isles with lots of food items: first check to see the name of each row/isle so you can begin to look for your first item on your shopping list. Also, take a basket to put in all your items.",
   },
   {
   "title":"Ask for Help from a Staff Member",
   "instructionCode":"FS1-S2",
   "details":"In the store, you will see many other shoppers like yourself, and the staff working in the store. They are there to help you! If you need any help, please go to a staff member and ask for help. Remember to first give them a friendly smile and say hello!",
   "socialSkill":"Keeping good eye-contact",
   "socialSkillText":"Keeping good eye contact communicates that you are interested and engaged in the conversation.",
    "youtubeID":"IV9jB0f590U",
   },
   {
   "title":"Use Good Speaking Skills with Staff Member",
   "instructionCode":"FS1-S3",
   "details":"The staff member will explain to you in which isle to find your food items if you struggle to find it yourself. When the staff member is explaining to you what to do next to find your food/ shopping item, make sure that you listen well to the explanation.",
   "socialSkill":"Listening",
   "socialSkillText":"It is important to listen closely to the information provided by the staff member, it can often times seem easy to forget. Using good volume will show that you are comfortable and will ensure that the staff member hears you clearly.",
   "youtubeID":"ulFFTKuJI-g",
   },
   {
   "title":"Check Out Your Items",
   "instructionCode":"FS1-S4",
   "details":"When you have found all of your items, you will need to find a check point where you will pay for your items. When you are at the check point, remember to ask how much money your items cost and hand the money to the cashier."
   }
   ]
  },
 {
  "name":"Learn a Sport or Game",
  "activityCode":"SP1",
  "description":"You need sports clothes and shoes. For a new game, you will need the rules of the game.",
  "category":"Do we need this?",
  "icon":"game",
  "instructions":
  [
    {
	 "title":"Make Preparations",
     "instructionCode":"SP1-S1",
     "details":"Put on your sport clothes and find a group or a coach that will help you learn the sport. For the new game, make sure you have all materials and a safe space to play."
    },
	{
   "title":"Remember to be Sportsmanlike",
     "instructionCode":"SP1-S2",
     "details":"Remember to enjoy the sport and make sure to follow the rules of the game.",
   "socialSkill":"Good Sportsmanship",
   "socialSkillText":"Being a good sport is essential to ensuring everybody has a good time.",
   "youtubeID":"P_HQ4drWEUs"
	},
	{
	 "title":"Remember to use an Appropriate Level of Competitiveness",
     "instructionCode":"SP1-S3",
     "details":"When you play the sport or game do not become too competitive with your friends or else you will not enjoy it.",
	 "socialSkill":"Good Sportsmanship",
	 "socialSkillText":"Utilizing an appropriate level of competitiveness will ensure that feelings don't spoil the fun, all while keeping the game engaging.",
   "youtubeID":"w7_WLRpiuII"
	},
	{
	 "title":"Show Your Appreciation Towards Those Involved",
     "instructionCode":"SP1-S4",
     "details":"At the end, thank your coach and everyone else who played with you.",
	}
  ]
 },
 {
 "name":"Walk Dog",
  "activityCode":"WD1",
  "description":"You will walk your dog",
  "category":"Do we need this?",
  "icon":"dog walk",
  "instructions":
  [
    {
	 "title":"Harness Leash to Dog",
     "instructionCode":"WD1-S1",
     "details":"Make sure that your leash is correctly fastened to your dog's collar.",
    },
	{
	 "title":"Be Ready to Initiate Conversation with Others",
     "instructionCode":"WD1-S2",
     "details":"While walking your dog, other people will be interested to talk to you or you may begin conversation with others.",
   "socialSkill":"Starting Individual Conversation",
   "socialSkillText":" ",
   "youtubeID":"oGKpxr4LwyU"
	},
	{
	 "title":"Be Careful While Walking and Try to Engage in Conversation with Others",
     "instructionCode":"WD1-S3",
     "details":"Be careful not to walk in the street but stay on the sidewalk while walking your dog. Enjoy greeting and talking to other dog walkers. Below is an example of poorly initiated conversation.",
	 "socialSkill":"Starting Individual Conversation",
   "socialSkillText":" ",
	 "youtubeID":"9ZKm6iT-uSg",
	},
	{
	 "title":"Returning Home With Your Dog",
     "instructionCode":"WD1-S4",
     "details":"Remove your dog’s leash when you are done walking and remember to give your dog water.",
	}
  ]
 },
 {
 "name":"Get Together for Movies",
  "activityCode":"MV1",
  "description":"You need a group of friends or family and a nice movie to watch.",
  "category":"Do we need this?",
  "icon":"movie",
  "instructions":
  [
    {
	 "title":"Find a Place to Watch",
     "instructionCode":"MV1-S1",
     "details":"Decide where you will watch the movie together as a group.",
    },
	{
	 "title":"If Applicable, be a Good Host",
     "instructionCode":"MV1-S2",
     "details":"If friends are watching the movie at your house, please welcome them and make them feel at home.",
   "socialSkill":"Get-togethers",
   "socialSkillText":" ",
   "youtubeID":"HYBB-E9E8zs"
	},
	{
	 "title":"Provide Refreshments for Guests",
     "instructionCode":"MV1-S3",
     "details":"Make sure you have lots of popcorn and soft drinks for everyone and enjoy the movie. Below is an example of being a bad host.",
	 "socialSkill":"Get-togethers",
	 "socialSkillText":" ",
   "youtubeID":"umg-6cL4bRA"
	},
	{
	 "title":"Afterwards, Thank Your Guests for Attending",
     "instructionCode":"MV1-S4",
     "details":"When the movie is done, thank everyone for coming to house to enjoy the movie.",
	}
  ]
 },
  {
  "name":"Play or Listen to Music",
  "activityCode":"MU1",
  "description":"You need a musical instrument to learn how to play it or a radio or CD player to listen to music.",
  "category":"Do we need this?",
  "icon":"music",
  "instructions":
  [
   {
   "title":"Use Good Listening Skills",
   "instructionCode":"MU1-S1",
   "details":"If you are in lessons for a musical instrument, listen to the music teacher well. If you are simply listening to music on the radio or CD player, make sure the volume is not too loud.",
   },
   {
   "title":"Exchanging Contact Info",
   "instructionCode":"MU1-S2",
   "details":"Sometimes your music teacher may ask for your contact details to call you for your next session. Or, someone may ask your details to send you new songs.",
   "socialSkill":"Exchanging Contact Information",
   "socialSkillText":" ",
   "youtubeID":"z5rIAetolzk"
   },
   {
   "title":"Remember to be Careful When Exchanging Info",
   "instructionCode":"MU1-S3",
   "details":"Be careful with giving out your contact information. The below video depicts a poor example of exchanging contact information.",
   "socialSkill":"Exchanging Contact Information",
   "socialSkillText":" ",
   "youtubeID":"vSlvTxnpIaM"
   },
   {
   "title":"Enjoy Your Music!",
   "instructionCode":"MU1-S4",
   "details":"Make sure to practice your new instrument or enjoy listening to your favourite songs.",
   }
   ]
  },
  {
  "name":"Enjoy Exercise With Friends",
  "activityCode":"EX1",
  "description":"You need to join a gym or group that exercise regularly.",
  "category":"Do we need this?",
  "icon":"exercise",
  "instructions":
  [
   {
   "title":"Find a Group to Exercise With and Wear Appropriate Attire",
   "instructionCode":"EX1-S1",
   "details":"Look out for groups that exercise together and get comfortable clothes and shoes ready.",
   },
   {
   "title":"Engage in Conversation Before or After the Session",
   "instructionCode":"EX1-S2",
   "details":"Before you start the exercise or after your session, join the group for a chat.",
   "socialSkill":"Entering a Group Conversation",
   "socialSkillText":" ",
   "youtubeID":"A1-EUEnOex4"
   },
   {
   "title":"Enjoy the Company of Others",
   "instructionCode":"EX1-S3",
   "details":"Be friendly with all group members and enjoy their company. The video below depicts how not to behave in group conversations.",
   "socialSkill":"Entering a Group Conversation",
   "socialSkillText":" ",
   "youtubeID":"inZORCtOOes"
   },
   {
   "title":"Take Care of Yourself Following Your Activity",
   "instructionCode":"EX1-S4",
   "details":"After your exercise, take a shower and drinks lost of water to stay healthy.",
   }
   ]
  },
  {
  "name":"Go for a Walk in the Park",
  "activityCode":"PK1",
  "description":"You need a group of friends or family and a nice movie to watch.",
  "category":"Do we need this?",
  "icon":"park",
  "instructions":
  [
   {
   "title":"Find a Place to Watch",
   "instructionCode":"PK1-S1",
   "details":"Only go for a walk when it is daytime and ask someone to join you.",
   },
   {
   "title":"Be Ready to Converse with Others",
   "instructionCode":"PK1-S2",
   "details":"You will find many people who also go out for walks and you may have a few conversations with them.",
   "socialSkill":"Trading Information",
   "socialSkillText":" ",
   "youtubeID":"LHN-y6rsLrY"
   },
   {
   "title":"Be Open to Making Friends",
   "instructionCode":"PK1-S3",
   "details":"Take a rest and sit on a bench when you get tired. Don’t be shy to make new friends while you outside in the Park.",
   "socialSkill":"Trading Information",
   "socialSkillText":" ",
   "youtubeID":"BN2DocilWHM"
   },
   {
   "title":"Return From Your Walk",
   "instructionCode":"PK1-S4",
   "details":"You will fell refreshed once you’ve completed your walk.",
   }
   ]
  },
  {
  "name":"Visit a Restaurant or Coffee Shop",
  "activityCode":"CS1",
  "description":"You need your money and dress up nicely for your outing.",
  "category":"Do we need this?",
  "icon":"coffee",
  "instructions":
  [
   {
   "title":"Enter the Restaurant or Coffee Shop",
   "instructionCode":"CS1-S1",
   "details":"After finding a place to go, enter the restaurant or coffee shop and find a nice table to sit at.",
   },
   {
   "title":"Place Order and Converse with Staff",
   "instructionCode":"CS1-S2",
   "details":"Ask a staff waiter for the menu and place your order. If the waiter tries to make a joke with you, be polite even if you do not find the joke funny at all.",
   "socialSkill":"Appropriate Use of Humor",
   "socialSkillText":"Below is an example of how NOT to give a courtesy laugh.",
   "youtubeID":"Xwv-lwMIgBk"
   },
   {
   "title":"Be Engaging and Polite with the Staff",
   "instructionCode":"CS1-S3",
   "details":"Always smile and be kind to the waiter when he or she offers to help or check that you enjoy your meal or coffee.",
   "socialSkill":"Appropriate Use of Humor",
   "socialSkillText":"Below is an example of how to correctly give a courtesy laugh.",
   "youtubeID":"xgfLlLYhbHU"
   },
   {
   "title":"Pay Your Bill and Leave the Restaurant",
   "instructionCode":"CS1-S4",
   "details":"Pay your bill before you leave and politely thank the waiter for the service.",
   }
   ]
  }
]
